---
kind: enumMember
id: F:Autodesk.Revit.DB.PartEdgeConditionOrientation.MirroredAndRotated
enum: Autodesk.Revit.DB.PartEdgeConditionOrientation
source: html/da54576e-5aa4-7886-4bcf-0ad11b3c6a49.htm
---
# Autodesk.Revit.DB.PartEdgeConditionOrientation.MirroredAndRotated

Right/lower profile is obtained first by mirroring the left/upper profile with respect to the
 division line and then by mirroring the result with respect to the center line of the
 divided thickness. The division gap is not applied.